Notes/daily/2021-11-04.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2021-11-04</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.min.css" /><link rel="stylesheet" href="/custom.css" />
</head>
<body>
<div id="preamble" class="status">

<div class="header">
    <span class="title">2021-11-04</span>
    <div class="links">
        <a href="/">Home</a>
        <a href="/Notes/daily/2022-01-23.html">Latest daily</a>
        <a href="https://github.com/Minion3665/EPQ/issues/new">Report issue</a>
        <a href="https://github.com/Minion3665/EPQ">View source</a>
    </div>
</div>
</div>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1f84bf9">Breakdown to timeline</a></li>
</ul>
</div>
</div>
<div id="outline-container-org1f84bf9" class="outline-2">
<h2 id="org1f84bf9">Breakdown to timeline</h2>
<div class="outline-text-2" id="text-org1f84bf9">
<p>
Yesterday I made a project breakdown, but I need a project timeline, so I'm going to be setting months for each of the major items on the breakdown. I'll then make that into a timeline in figma.
</p>

<ul class="org-ul">
<li>Initial research step (November 2021)</li>
<li>Initial planning step (November 2021)</li>
<li>Development part 1 [Creating a basic process manager (sans-api)] (November 2021 - Janurary 2022)
<ul class="org-ul">
<li>Research (November 2021 - December 2021)</li>
<li>Development (December 2021 - Janurary 2022)</li>
</ul></li>
<li>Development part 2 [Creating an API to manage the process manager] (February 2022 - March 2022)
<ul class="org-ul">
<li>Research (February 2022)</li>
<li>Development (March 2022)</li>
</ul></li>
<li>Development part 3 [Optional depending on time] [Creating a system to manage the API, perhaps a web dashboard?] (April 2022 - June 2022)
<ul class="org-ul">
<li>Research (April 2022)</li>
<li>Development (April 2022 - June 2022)</li>
</ul></li>
<li>Deployment (June 2022 - Project end)
<ul class="org-ul">
<li>Deployment to non-critical systems (June 2022 - July 2022)</li>
<li>Deployment to critical servers (August 2022 &amp; Beyond (It's important to note that <i>this step is not critical for completion of the EPQ</i>, which is why it can (and should if not fully ready) be pushed back past the deadline end))</li>
</ul></li>
<li>Evaluation (July 2022 - Project end)
<ul class="org-ul">
<li>Evaluation of final product (July 2022)
<ul class="org-ul">
<li>Self evaluation (July 2022)</li>
<li>Peer evaluation (July 2022)</li>
</ul></li>
<li>Evaluation of project management (July 2022)</li>
</ul></li>
</ul>

<p>
<i>This is a rough/first-draft schedule; it won't necessarily be accurate and times may be shifted around in future notes. While I have attempted to create enough scalability that if stuff takes too long there is enough I can shorten or remove (and I've not scheduled the last month so that I can overflow into that if absolute necessary), I haven't created a contingency plan for if this takes far shorter than estimated. My current idea is to create a way to get SSL certificates and reverse proxy to those containers more easily, as that is a system that will be needed anyway and will likely be developed post-EPQ.</i>
</p>
</div>
</div>
</div>
</body>
</html>
